/* No comment provided by engineer. */
" and %@" = " ja %@";

/* elapsed time on recording screen, in seconds */
"%.1f sec" = "%.1f sekuntia";

/* update notice when someone comments. %1$@ is the commenter name, %2$@ is the comment. */
"%1$@ commented: %2$@" = "%1$@ kommentoi: %2$@";

/* update notice when someone suggests an ID. %1$@ is the username, %2$@ is the species. */
"%1$@ suggested an ID: %2$@" = "%1$@ ehdotti tunnistetta: %2$@";

/* confirmation alert text when changing a users network affiliation. %1%@ is network name, %2%@ is the country, %3%@ is the network name again */
"%@ is a member of the iNaturalist Network in %@. Local institutions supporting %@ will have access to your email address and access to the true coordinates for observations that are publicly obscured or private. Would you like to change your affiliation?" = "%1$@ on kansainvälisen iNaturalist-verkoston jäsen maassa %2$@. Suomessa paikallisesta toiminnasta vastaa Suomen Lajitietokeskus. Haluatko yhdistää tunnuksesi tähän (suositeltu)? Tällöin paikallinen organisaatio näkee havaintojesi tarkat paikat sekä sähköpostiosoitteesi, joten havaintosi tulevat paremmin hyötykäyttöön, ja voit saada paikallisia %3$@iin liittyviä tiedotteita.	";

/* join iNat network partner alert message - %1%@ is the country name, %2%@ is partner name */
"%@ is part of the international iNaturalist Network. Would you like to join %@ to localize your experience of iNaturalist and share data with local institutions?" = "%1$@ on jäsen kansainvälisessä iNaturalist-verkostossa. Haluatko liittyä %2$@: iin tehdäksesi iNaturalistin käytöstä paikallisempaa ja jakaaksesi tallentamasi sisällön paikallisten instituutioiden kanssa?";

/* site news */
"%@ News" = "%@ uutiset";

/* identification author attribution */
"%@'s ID" = "%@:n tunniste";

/* No comment provided by engineer. */
"%@, build %@" = "%1$@, build %2$@";

/* Count of observations by this user, singular. */
"%d Observation" = "%d havainto";

/* Count of observations to upload, singular. */
"%d Observation To Upload" = "%d havainto tallennettavana";

/* Count of observations by this user, plural. */
"%d Observations" = "%d havainnot";

/* Count of observations to upload, plural. */
"%d Observations To Upload" = "%d havaintoa tallennettavana";

/* format string for showing positional accuracy in meters */
"%ld m" = "%ld m";

/* No comment provided by engineer. */
"'%@' requires that you fill out the '%@' field." = "%1$@' vaatii että täytät '%2$@'-kentän.";

/* positional accuracy when we don't know */
"???" = "???";

/* About button title in Settings
   About project button
   about the project header
   title of about screen */
"About" = "Tietoja";

/* title for about section of the guide screen */
"ABOUT" = "TIETOJA";

/* about this project title */
"About this Project" = "Tietoja tästä projektista";

/* emphasis text for the 'switch to login mode' button. must be a substring of the base text */
"Account?" = "Tili?";

/* No comment provided by engineer. */
"Activity" = "Toiminta";

/* Title for add comment failed alert */
"Add Comment Failure" = "Kommentin lisäämshäiriö";

/* Title for add ID failed alert */
"Add Identification Failure" = "Tunnistuksen lisäämishäiriö";

/* No comment provided by engineer. */
"Add to Favorites" = "Lisää suosikkeihin";

/* Label for a button that adds an ID of the same taxon as the current one, so the sense is 'I agree with this identification' */
"Agree" = "Samaa mieltä";

/* base text for the 'switch to login mode' button */
"Already have an Account?" = "On jo tili?";

/* Status message when the database is unavailable and large parts of the app aren't working. Shouldn't happen, but fallback in case it ever does. */
"App is fatally misconfigured. Please contact help@inaturalist.org." = "Sovellus on väärin määritetty. Ota yhteyttä help@inaturalist.org.";

/* Title for app section of settings. */
"App Settings" = "Sovellusasetukset";

/* No comment provided by engineer. */
"Are you really sure?" = "Oletko aivan varma?";

/* No comment provided by engineer. */
"Are you sure you want to leave this project?" = "Haluatko varmasti jättää tämän projektin?";

/* No comment provided by engineer. */
"Are you sure?" = "Oletko varma?";

/* No comment provided by engineer. */
"Are you sure? This is permanent." = "Oletko varma? Tämä on pysyvää.";

/* argentina partner */
"Argentina: Fundación Vida Silvestre Argentina supporting ArgentiNat (www.argentinat.org)." = "Argentina: Fundación Vida Silvestre Argentina supporting ArgentiNat (www.argentinat.org).";

/* australia partner */
"Australia: Atlas of Living Australia supporting iNaturalist Australia (inaturalist.ala.org.au/)." = "Australia: Atlas of Living Australia supporting iNaturalist Australia (inaturalist.ala.org.au/).";

/* Auto state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"Auto" = "Automaattinen";

/* label for autocomplete names switch in settings */
"Autocomplete names" = "Täytä nimet automaattisesti";

/* label for auto upload switch in settings */
"Automatic upload" = "Automaattinen tallennus";

/* delete account confirmation */
"By deleting your account you will remove all of your observations, all of the identifications that you've added to the observations of others, and all comments that you've made. Furthermore, this action cannot be undone. If you change your mind later, you aren't getting any of that content back. If this site generates too many notifications, consider editing your settings to opt out of certain notifications or stop receiving email from us. If you're having trouble with a specific person on the site, consider muting them instead of deleting your account. If you are deleting your account because you tried to delete some of your content but you could still see it on a map or elsewhere on the Internet, keep in mind that map data may be cached for up to a day even after records are deleted, and that deleting content on this platform may not have any effect on copies that exist on other sites and platforms (like GBIF). If you're still sure you want to delete your account, enter '%@' in the form below and click the button to delete your account and all your data." = "Tilisi poisto poistaa kaikki havaintosi, kaikki tunnistuksesti, jotka olet lisännyt muiden havaintoihin sekä kaikki kommentit, jotka olet tehnyt. Tätä toimintoa ei voi peruuttaa. Jos muutat mielesi myöhemmin, et saa mitään luomastasi sisällöstä takaisin. Jos saat liian monta ilmoitusta tältä sivustolta, harkitse ilmoitusasetusten muokkaamista jättääksesi tietyt ilmoitukset pois tai lopettaaksesi sähköpostin vastaanottamisen. Jos sinulla on ongelmia tietyn henkilön kanssa sivustolla, harkitse mykistämistä sen sijaan, että poistaisit tilisi. Jos olet poistamassa tilisi, koska yritit poistaa osan sisällöstä, mutta näet sen edelleen kartalla tai muualla Internetissä, huomaa, että karttatietoja voidaan pitää välimuistissa enintään päivän ajan myös tietueiden poistamisen jälkeen, ja että sisällön poistolla tältä alustalta, ei välttämättä ole vaikutusta kopioihin, joita on muilla sivustoilla ja alustoilla (kuten GBIF). Jos olet edelleen varma, että haluat poistaa tilisi, syötä%@' alla olevaan lomakkeeseen ja napsauta painiketta poistaaksesi tilisi ja kaikki tietosi.";

/* Base text for terms of service and privacy policy notice when creating an iNat account. */
"By using iNaturalist you agree to the Terms of Service and Privacy Policy." = "Käyttämällä iNaturalistia, hyväksyt Käyttöehdot ja Tietosuojakäytännön.";

/* vision assistance */
"CalTech and Cornell Tech helped develop the computer vision system that suggests identifications from photographs. We thank Grant Van Horn, Serge Belongie, and Pietro Perona for advancing the computer vision research. More information can be found at visipedia.org. Special thanks to NVIDIA for additional assistance." = "CalTech ja Cornell Tech auttoivat kehittämään konenäköjärjestemän, joka ehdottaa tunnistuksia valokuvista. Kiitämme Grant Van Hornia, Serge Belongieta, ja Pietro Peronaa konenäkötutkimuksen edistämisestä. Lisää tietoa osoitteesta visipedia.org. Erityiskiitos NVIDIA:lle lisäavusta.";

/* Title for Camera button in media picker */
"Camera" = "Kamera";

/* accessibility label for camera shutter button */
"Camera Shutter" = "Kameran suljin";

/* No comment provided by engineer. */
"Can't Add ID" = "Ei voi lisätä tunnistetta";

/* No comment provided by engineer. */
"Can't Comment" = "Ei voi kommentoida";

/* No comment provided by engineer. */
"Can't Fave" = "Ei voi merkitä suosikiksi";

/* Status message when the app can't start due to a corrupt database but the database doesn't exist. Shouldn't happen, but fallback in case it ever does. */
"Can't find realm database, can't continue. Please contact help@inaturalist.org." = "Tietokantaa ei löydy, ei voida jatkaa. Ota yhteyttä osoitteeseen help@inaturalist.org.";

/* Error message for when we can't retrieve your observations on Explore */
"Can't search for your observations right now. Please try later." = "Havaintojen haku ei onnistunut juuri nyt. Ole hyvä ja yritä uudelleen myöhemmin.";

/* Status message when email is not configured on the phone so we can't send email on a user's behalf. */
"Can't send crash support email - please contact help@inaturalist.org." = "Ei voi lähettää viestiä sovelluksen kaatumisesta sähköpostitse – ota yhteyttä help@inaturalist.org.";

/* canada partner */
"Canada: Canadian Wildlife Federation, the Royal Ontario Museum, NatureServe Canada, and Parks Canada operating iNaturalist Canada (inaturalist.ca)." = "Kanada: Canadian Wildlife Federation, Royal Ontario Museum, NatureServe Canada ja Parks Canada ylläpitävät portaalia iNaturalist Canada (inaturalist.ca).";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* Title of me header while cancellling an upload session. */
"Cancelling..." = "Peruutetaan...";

/* Alert message for invalid date */
"Cannot choose a date in the future." = "Et voi valita päivää, joka on tulevaisuudessa.";

/* Failure message */
"Cannot donate" = "Ei voida lahjoittaa";

/* error when loading suggestions. %@ is the error message */
"Cannot load suggestions: %@" = "Ei voida ladata ehdotuksia: %@";

/* Store launch failure message */
"Cannot open store" = "Kaupan avaaminen epäonnistui";

/* Failure message */
"Cannot rate" = "Ei voida arvostella";

/* No comment provided by engineer. */
"Cannot search iNaturalist.org" = "iNaturalistista ei voida hakea";

/* Title of alert when the system is not configured for the user to send email */
"Cannot Send Email" = "Sähköpostin lähetys ei onnistu";

/* No comment provided by engineer. */
"Cannot use your location" = "Ei voida käyttää sijaintiasi";

/* Captive / cultivated button title. */
"Captive / Cultivated" = "Vankeudessa / viljelty";

/* message explaining what captive / cultivated means for iNaturalist */
"Captive / cultivated means that the organism exists where it was observed because humans intended it to be there. iNaturalist is about observing wild organisms, and our scientific data partners are not interested in observations of pets, gardens, or animals in zoos." = "Vangittu / viljelty tarkoittaa että eliö esiintyy havaintopaikassa koska ihmiset halusivat sen olevan siellä. iNaturalistin tarkoituksena on havainnoida villejä eliöitä, ja tieteelliset kumppanimme eivät toivo havaintoja lemmikeistä, puutarhoista tai eläintarha-eläimistä.";

/* title for captive selector */
"Captive?" = "Vangittu?";

/* casual data quality */
"Casual Grade" = "Epämuodollinen";

/* label for change email address action in settings */
"Change email" = "Vaihda sähköposti";

/* No comment provided by engineer. */
"Change Email" = "Vaihda sähköposti";

/* No comment provided by engineer. */
"Change email address?" = "Vaihda sähköpostiosoite?";

/* accessibility label for change flash button */
"Change Flash" = "Vaihda salama";

/* accessibility label for flash button when mode is auto */
"Change Flash Toggle. Current state is Auto" = "Muuta salaman valinta. Nyt automaattinen";

/* accessibility label for flash button when mode is off */
"Change Flash Toggle. Current state is Off" = "Muuta salaman valinta. Nyt poissa päältä";

/* accessibility label for flash button when mode is on */
"Change Flash Toggle. Current state is On" = "Muuta salaman valinta. Nyt päällä";

/* label for change username action in settings */
"Change username" = "Vaihda käyttäjänimi";

/* No comment provided by engineer. */
"Change Username" = "Vaihda käyttäjänimi";

/* No comment provided by engineer. */
"Change username?" = "Vaihda käyttäjänimi?";

/* No comment provided by engineer. */
"Change your profile photo?" = "Vaihda profiilikuvasi?";

/* Alert text for the license content checkbox during create account. */
"Check this box if you want to apply a Creative Commons Attribution-NonCommercial license to your photos. You can choose a different license or remove the license later, but this is the best license for sharing with researchers." = "Laita tähän ruksi jos haluat liittää Creative Commons Nimeä-Epäkaupallinen -lisenssin havaintoihisi. Voit valita erilaisen lisenssin tai poistaa lisenssin myöhemmin, mutta tämä on paras lisenssi jos haluat jakaa havaintosi tutkijoiden käyttöön.";

/* title of alert after you reset your password
   title of email confirmation needed alert. */
"Check your email" = "Tarkista sähköpostisi";

/* chile partner */
"Chile: Ministerio del Medio Ambiente supporting iNaturalist Chile (inaturalist.mma.gob.cl)." = "Chile: Ministerio del Medio Ambiente supporting iNaturalist Chile (inaturalist.mma.gob.cl).";

/* No comment provided by engineer. */
"Choose from library" = "Valitse kirjastosta";

/* title of inat network picker */
"Choose iNat Network" = "Valitse iNat-verkko";

/* title for project observations chooser */
"Choose Projects" = "Valitse projektit";

/* No comment provided by engineer. */
"Close" = "Sulje";

/* accessibility label for close camera button */
"Close Camera" = "Sulje kamera";

/* Collection type of project, which automatically collects observations into it. */
"Collection Project" = "Kokoelmaprojekti";

/* colombia partner */
"Colombia: Instituto Humboldt operating Naturalista (colombia.inaturalist.org)." = "Kolumbia: Instituto Humboldt ylläpitävät portaalia Naturalista (colombia.inaturalist.org).\n";

/* No comment provided by engineer. */
"Comment" = "Kommentti";

/* Button to contact support when app has failed to launch. */
"Contact Support" = "Ota yhteyttä tukeen";

/* label for contact support action in settings. */
"Contact support" = "Ota yhteys tukeen";

/* Title for About Content Licensing notice during signup */
"Content Licensing" = "Sisällön lisensointi";

/* Button to copy the scientific name */
"Copy Scientific Name" = "Kopioi tieteellinen nimi";

/* Title of an alert dialog you see when you try to agree with an identification but cannot due to connection issues or other errors */
"Couldn't Agree" = "Epäonnistui";

/* Project validation error. first string is project title, second is the specific error */
"Couldn't be added to project %@. %@" = "Ei voitu lisätä projektiin %1$@. %2$@";

/* No comment provided by engineer. */
"Couldn't determine your location" = "Sijaintiasi ei voitu määrittää";

/* HUD text when creating a new observation from multiple photos */
"Creating Observation..." = "Luodaan Havaintoa...";

/* intro to credits section. */
"Credits" = "Tekijät";

/* Title for danger zone (account deletion) section of settings. */
"Danger Zone" = "Vaaravyöhyke";

/* Header for data quality section of obs detail */
"Data Quality" = "Tietojen laatu";

/* Title for About Data Transfer notice during signup */
"Data Transfer" = "Tiedonsiirto";

/* No comment provided by engineer. */
"Default" = "Oletus";

/* button title to delete account */
"Delete Account" = "Poista tilisi";

/* button to  delete a locally downloaded species guide. */
"Delete download" = "Poista lataus";

/* No comment provided by engineer. */
"Delete Error" = "Poistovirhe";

/* Button to delete the database. This will appear in red as a destructive action. */
"Delete Local Database and Try Again" = "Poista paikallinen tietokanta ja yritä uudelleen";

/* text of delete obs button */
"Delete Observation" = "Poista havainto";

/* Deletes pending sync. */
"Deletes To Sync" = "Synkronoitavat poistot";

/* title for description section of the guide screen */
"DESCRIPTION" = "KUVAUS";

/* Title for confirm new observation details view */
"Details" = "Tiedot";

/* Status message when the user tapped contact support but then chose to not allow us to send a support email on their behalf. */
"Didn't send crash support email - please contact help@inaturalist.org." = "Ei lähettänyt viestiä sovelluksen kaatumisesta – ota yhteyttä help@inaturalist.org.";

/* Button to cancel showing tutorial screens when visiting new tabs */
"Don't Show Me Hints" = "Älä näytä minulle vihjeitä";

/* label for iNaturalist donate call to action. */
"Donate to iNaturalist" = "Lahjoita iNaturalistille";

/* title for done button */
"Done" = "Valmis";

/* No comment provided by engineer. */
"Download" = "Lataa";

/* title for button that allows a user to download a species guide and use it while offline. */
"Download for offline use" = "Lataa offline-käyttöön";

/* No comment provided by engineer. */
"Download not available" = "Lataus ei ole käytettävissä";

/* notice that a species guide has been downloaded from the server and can be used while offline. */
"Downloaded" = "Ladattu";

/* Notice when we're downloading a species guide from the server, to be used offline */
"Downloading..." = "Ladataan...";

/* ecuador partner */
"Ecuador: Instituto Nacional de Biodiversidad (INABIO) supporting iNaturalist Ecuador (ecuador.inaturalist.org)." = "Ecuador: Instituto Nacional de Biodiversidad (INABIO) tukee iNaturalist Ecuadoria (ecuador.inaturalist.org).";

/* The editor or author of the species guide */
"Editor" = "Muokkain";

/* message for the alert when a guide download fails, if we can't extract an error message. */
"Either there was an error on the server or the guide no longer exists." = "Virhe palvelimella tai opasta ei enää ole olemassa.";

/* label for email field in settings */
"Email" = "Sähköposti";

/* Title for error alert */
"Error" = "Virhe";

/* failure title when changing a setting. */
"Error changing setting." = "Virhe asetusta muutettaessa.";

/* No comment provided by engineer. */
"Error Fetching Observations" = "Virhe havaintoja haettaessa";

/* error loading leaderboard title */
"Error loading leaderboard" = "Virhe tulostaulukkoa ladatessa";

/* No comment provided by engineer. */
"Explore" = "Tutki";

/* Status message when the user tries to delete the DB but it fails. */
"Failed to delete database. Please contact help@inaturalist.org." = "Tietokannan poistaminen epäonnistui. Ota yhteyttä osoitteeseen help@inaturalist.org.";

/* title of alert when a guide download fails. a localized error message provided by iOS or the server follows. */
"Failed to download guide" = "Virhe ladattaessa opasta";

/* Unknown iNat login error */
"Failed to log in to iNaturalist. Please try again." = "Kirjautuminen iNaturalistiin epäonnistui. Ole hyvä ja yritä uudelleen.";

/* title of alert when sound recording fails */
"Failed to Record" = "Tallennus epäonnistui";

/* No comment provided by engineer. */
"Failed to save guide" = "Oppaan tallentaminen epäonnistui";

/* title of alert when sound recording setup fails */
"Failed to Setup Sound Recording" = "Failed to Setup Sound Recording";

/* No comment provided by engineer. */
"Faved" = "Merkitty suosikiksi";

/* No comment provided by engineer. */
"Faves" = "Faves";

/* No comment provided by engineer. */
"Featured" = "Suositellut";

/* This is an explanation for when auth token fetch fails during upload/sync. */
"Fetching an authentication token failed. Please contact help@inaturalist.org and try later." = "Autentikointi-tokenin haku epäonnistui. Ole hyvä ja ota yhteyttä osoitteeseen help@inaturalist.org ja yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"Fetching recent observations in map area" = "Haetaan tuoreita havaintoja kartan alueelta";

/* No comment provided by engineer. */
"Fetching recent observations worldwide" = "Haetaan tuoreita havaintoja maailmanlaajuisesti";

/* No comment provided by engineer. */
"Find locations named '%@'" = "Etsi paikkoja nimeltä '%@'";

/* No comment provided by engineer. */
"Find my observations" = "Hae havaintoni";

/* No comment provided by engineer. */
"Find observations near me" = "Hae havaintoja läheltä minua";

/* No comment provided by engineer. */
"Find organisms named '%@'" = "Etsi eliöitä nimeltä '%@'";

/* No comment provided by engineer. */
"Find people named '%@'" = "Etsi henkilöitä nimeltä '%@'";

/* No comment provided by engineer. */
"Find projects named '%@'" = "Etsi projekteja nimeltä '%@'";

/* No comment provided by engineer. */
"Finding your location..." = "Haetaan sijaintiasi...";

/* finland partner */
"Finland: Finnish Museum of Natural History (Luomus) supporting iNaturalist Finland (https://inaturalist.laji.fi)." = "Suomen luonnontieteellinen museo tukee iNaturalist Finlandia (https://inaturalist.laji.fi).";

/* Title for forgot password button. */
"Forgot password?" = "Unohditko salasanan?";

/* Geoprivacy button title */
"Geoprivacy" = "Sijainnin tietosuoja";

/* No comment provided by engineer. */
"Go Back" = "Mene takaisin";

/* Button to dismiss a tutorial screen */
"Got It" = "Selvä";

/* greece partner */
"Greece: iSea supporting iNaturalist Greece (greece.iNaturalist.org)." = "Kreikka: iSea tukee iNaturalist Kreikkaa (greece.iNaturalist.org).";

/* Grid layout on explore tab */
"Grid" = "Grid";

/* No comment provided by engineer. */
"Guide download error" = "Virhe oppaan lataamisessa";

/* No comment provided by engineer. */
"Guide editor must enable this feature." = "Oppaan muokkaajan on otettava tämä ominaisuus käyttöön.";

/* accessibility label for guides button */
"Guides" = "Oppaat";

/* Subtitle above image for guides tutorial screen */
"Guides are created and shared by the iNaturalist community" = "Oppaat ovat iNaturalist-yhteisön tekemiä ja jakamia";

/* Title for guides tutorial screen */
"Guides are lists of species" = "Oppaat ovat listoja lajeista";

/* Part of the text summarizing an observation spoken by a screen reader indicating whether an observation has photos */
"Has Photos" = "Has Photos";

/* Part of the text summarizing an observation spoken by a screen reader indicating whether an observation has sounds */
"Has Sounds" = "Has Sounds";

/* Title for help section of settings. */
"Help" = "Ohje";

/* No comment provided by engineer. */
"Here are our top suggestions:" = "Tässä ovat parhaat suosituksemme:";

/* personal info consent checkbox label */
"I consent to allow iNaturalist to store and process limited kinds of personal information about me in order to manage my account." = "Kyllä, suostun siihen, että iNaturalist tallentaa ja käyttää tiettyjä henkilötietojani käyttäjätilini hallintaan.";

/* data transfer consent checkbox label */
"I consent to allow my personal information to be transferred to the United States of America." = "Hyväksyn henkilötietojeni siirtämisen Amerikan yhdysvaltoihin.";

/* Title of identification failure alert */
"Identification Failed" = "Tunnistaminen epäonnistui";

/* Title for taxon section when adding an ID */
"Identification Taxon" = "Taksonin tunnistus";

/* No comment provided by engineer. */
"Identifications" = "Tunnistamiset";

/* No comment provided by engineer. */
"Identifiers" = "Tunnisteet";

/* body of alert after you reset your password */
"If the email address you entered is associated with an iNaturalist account, you should receive an email at that address with a link to reset your password." = "Jos antamasi sähköpostiosoite on liitetty iNaturalist-tunnukseen, saat pian sähköpostiviestin, jossa on linkki salasanan uusimiseksi.";

/* message of alert when mic permission is missing */
"If you wish to record a sound observation, you will need to give the iNaturalist app permission to use the microphone." = "Jos haluat tehdä äänihavainnon, anna mikrofonin käyttölupa sovellukselle.";

/* Message when we can't make the image store for the app */
"ImageStore Creation Error" = "Virhe luodessa ImageStorea";

/* Message when we can't save to the app image store */
"ImageStore Save Error" = "Virhe tallentaessa ImageStorea";

/* No comment provided by engineer. */
"in project '%@'" = "projektissa '%@'";

/* alert title for camera denied */
"iNaturalist doesn't have permission to access your camera." = "iNaturalistilla ei ole lupaa käyttää kameraa.";

/* inat core team, alphabetically */
"iNaturalist exists thanks to every single person who participates in our community. The people who build the software, design the interfaces, maintain our infrastructure, support the community, and foster collaborations are Yaron Budowski, Amanda Bullington, Tony Iwane, Johannes Klein, Patrick Leary, Scott Loarie, Abhas Misraraj, Sylvain Morin, Carrie Seltzer, Alex Shepard, Angie Ta, and Ken-ichi Ueda." = "iNaturalist on olemassa kaikkien sen yhteisöön osallistuvien ansiosta. Ohjelmistoa suunnittelee, kehittää ja ylläpitää sekä yhteisöä tukevat Yaron Budowski, Amanda Bullington, Tony Iwane, Johannes Klein, Patrick Leary, Scott Loarie, Abhas Misraraj, Sylvain Morin, Carrie Seltzer, Alex Shepard, Angie Ta ja Ken-ichi Ueda.";

/* alert title for camera restricted */
"iNaturalist has been restricted from camera access." = "iNaturalistilla on rajoitettu kameran käyttöoikeus.";

/* inat independent org statement */
"iNaturalist is an independent 501(c)(3) nonprofit based in the United States (EIN 92-1296468)" = "iNaturalist on riippumaton ja voittoa tavoittelematon organisaatio, jonka toimipaikka on Yhdysvalloissa (EIN 92-1296468)";

/* label for inaturalist network action in settings */
"iNaturalist Network" = "iNaturalist -verkosto";

/* Category of iNaturalist places for place search */
"iNaturalist Places" = "iNaturalist Paikat";

/* open source contributions */
"iNaturalist uses Glyphish icons by Joseph Wain, ionicons by Ben Sperry, and icons by Luis Prado and Roman Shlyakov from the Noun Project. iNaturalist is also deeply grateful to the Cocoapods community, and to the contributions of our own open source community. See https://github.com/inaturalist/INaturalistIOS." = "iNaturalist käyttää Joseph Wainin Glyphish-ikoneita, Ben Sperryn ionicons-ikoneita sekä Noun Project:in Luis Pradon and Roman Shlyakovin ikoneita. iNaturalist on myös kiitollinen Cocoapods-yhteisölle sekä avoimen lähdekoodin yhteisömme avulle. Katso https://github.com/inaturalist/INaturalistIOS.";

/* Error msg when we get a 401 from the server */
"Incorrect username or password." = "Virheellinen käyttäjänimi tai salasana.";

/* No comment provided by engineer. */
"Info" = "Tietoja";

/* No comment provided by engineer. */
"Internet connection required" = "Internet-yhteys vaaditaan";

/* No comment provided by engineer. */
"Internet required" = "Edellytetään Internetiä";

/* title of autoupload introduction alert view */
"Introducing Auto Upload!" = "Esittelyssä automaattitallennus!";

/* Invalid date alert title */
"Invalid Date" = "Virheellinen päivämäärä";

/* Error for bad email when making account. */
"Invalid Email Address" = "Virheellinen sähköpostiosoite";

/* Unknown invalid input */
"Invalid input" = "Virheellinen syöte";

/* No comment provided by engineer. */
"Invalid Location" = "Virheellinen sijainti";

/* Error for bad username when making account. */
"Invalid Username" = "Virheellinen käyttäjänimi";

/* israel partner */
"Israel: University of Haifa supporting iNaturalist Israel (israel.inaturalist.org)." = "Israelin Haifan yliopisto tukee iNaturalist Israelia (israel.inaturalist.org).";

/* iucn places credit */
"IUCN category II places provided by IUCN and UNEP-WCMC (2015), The World Database on Protected Areas (WDPA) [On-line], [11/2014], Cambridge, UK: UNEP-WCMC. Available at: www.protectedplanet.net." = "IUCN:n kategorian II paikat perustuen IUCN:n ja UNEP-WCMC:n (2015) tietoihin, tietokantaan The World Database on Protected Areas (WDPA) [On-line], [11/2014], Cambridge, UK: UNEP-WCMC. Saatavissa: www.protectedplanet.net.";

/* Join project button */
"Join" = "Liity";

/* join iNat network partner alert title */
"Join %@?" = "Liity %@iin?";

/* Subtitle above image for projects tutorial screen */
"Join projects to select them when you record observations" = "Liity projekteihin, niin voit liittää havaintosi niihin.";

/* No comment provided by engineer. */
"Joined" = "Liittynyt";

/* No comment provided by engineer. */
"Joining..." = "Liitytään...";

/* visualization of latitude/longitude/accuracy */
"Lat: %.5f Long: %.5f Acc: %@" = "Leveys: %1$.5f Pituus: %2$.5f Tarkkuus: %3$@";

/* format string for showing latitude, longitude, & positional accuracy */
"Lat: %1$@, Long: %2$@, Acc: %3$@" = "Leveys: %1$@, pituus: %2$@, tarkkuus: %3$@";

/* Title for leaderboard page. */
"Leaderboard" = "Tulostaulukko";

/* button to learn more about inat account policies */
"Learn More" = "Lue lisää";

/* learn more (about network partner changes) button text */
"Learn more" = "Lue lisää";

/* No comment provided by engineer. */
"Learn more about data quality >" = "Lisätietoja tietojen laadusta >";

/* Leave project button */
"Leave" = "Poistu";

/* No comment provided by engineer. */
"Leaving..." = "Poistutaan...";

/* The license of the species guide */
"License" = "Lisenssi";

/* List layout on explore tab */
"List" = "List";

/* No comment provided by engineer. */
"Loading..." = "Ladataan...";

/* No comment provided by engineer. */
"Location Fetch Error" = "Virhe paikan hakemisessa";

/* No comment provided by engineer. */
"Location Services Denied" = "Sijaintipalvelut kielletty";

/* No comment provided by engineer. */
"Location Services Restricted" = "Paikannuspalvelut rajoitettu";

/* Title for button that allows users to log in to their existing iNat account */
"Log In" = "Kirjaudu sisään";

/* No comment provided by engineer. */
"Log In / Sign Up" = "Kirjaudu sisään / rekisteröidy";

/* No comment provided by engineer. */
"Log in and upload this observation to enable comments & identifications." = "Kirjaudu sisään ja lataa tämä havainto ottaaksesi kommentit & tunnisteet käyttöön.";

/* No comment provided by engineer. */
"Log in to enable faves." = "Kirjaudu sisään ottaaksesi suosikit käyttöön.";

/* Notice while we're logging in */
"Logging in..." = "Kirjaudutaan sisään...";

/* placeholder text for taxon search bar */
"Look up a species by name" = "Etsi lajia nimellä";

/* unknown taxon subtitle when suggestions are unavailable */
"Look up species name" = "Etsi lajinimeä";

/* No comment provided by engineer. */
"Looks like there was an error: %@" = "Virhe: %@";

/* Notice to display to the user on the Me tab when they have no observations */
"Looks like you have no observations." = "Näyttää siltä että sinulla ei ole havaintoja.";

/* label for app store rating action in settings. */
"Love iNat? Rate us" = "Pidätkö kovasti iNatista? Arvostele meidät";

/* luxembourg partner */
"Luxembourg: Luxembourg National Museum of Natural History (MnhnL) supporting iNaturalist Luxembourg (inaturalist.lu)." = "Luxemburgin luonnonhistorian kansallismuseo (MnhnL) tukee iNaturalist Luxembourgia (inaturalist.lu).";

/* No comment provided by engineer. */
"Make sure iNat has permission to access your location or give the GPS some time to fetch it." = "Varmista että iNauralistilla on oikeus käyttää sijaintiasi ja anna GPS: lle aikaa paikantaa sinut.";

/* title for action sheet allowing user to delete a locally downloaded guide. */
"Manage download" = "Hallitse latauksia";

/* Map layout on explore tab */
"Map" = "Kartta";

/* No comment provided by engineer. */
"Map of Observations" = "Havaintojen kartta";

/* Placeholder text for not logged title on me tab. */
"Me" = "Minä";

/* mexico partner */
"Mexico: Comisión nacional para el conocimiento y uso de la biodiversidad (CONABIO) operating NaturaLista (NaturaLista.mx)." = "Meksiko: Comisión nacional para el conocimiento y uso de la biodiversidad (CONABIO) ylläpitää portaalia NaturaLista (NaturaLista.mx).";

/* Title for alert when db migration fails. */
"Migration Failed" = "Siirto epäonnistui";

/* Title for alert when db migration had a problem. */
"Migration Problem" = "Ongelma siirrossa";

/* No comment provided by engineer. */
"Missing Date" = "Puuttuva päivämäärä";

/* No comment provided by engineer. */
"Missing Location" = "Puuttuva sijainti";

/* No comment provided by engineer. */
"Missing Required Field" = "Puuttuva pakollinen kenttä";

/* No comment provided by engineer. */
"My Content" = "Sisältöni";

/* No comment provided by engineer. */
"named '%@ (%@)'" = "nimetty '%1$@ (%2$@)'";

/* No comment provided by engineer. */
"named '%@'" = "nimetty %@";

/* No comment provided by engineer. */
"Nearby" = "Lähellä";

/* No comment provided by engineer. */
"Nearby Suggestions Filter" = "Lähellä olevien ehdotusten suodatin";

/* needs id data quality */
"Needs ID" = "Tarvitsee tunnistuksen";

/* subtitle for an observation that failed validation. */
"Needs Your Attention" = "Tarvitsee huomiotasi";

/* Network (i.e. an Internet connection) is required error message */
"Network is required." = "Edellytetään verkkoa.";

/* No comment provided by engineer. */
"Network unavailable" = "Verkko ei ole käytettävissä";

/* No comment provided by engineer. */
"Network Unavailable" = "Verkko ei ole käytettävissä";

/* decline to change cemra permissions button title */
"Never mind" = "Unohda koko juttu";

/* Part of the text summarizing an observation spoken by a screen reader indicating whether an observation has new activity */
"new activity" = "new activity";

/* base text for the 'switch to signup mode' button */
"New to iNaturalist? Sign up now!" = "Uusi iNaturalistiin? Rekisteröidy nyt!";

/* nz partner */
"New Zealand: New Zealand Biodiversity Recording Network operating iNaturalist NZ — Mātaki Taiao (inaturalist.nz)." = "Uusi-Seelanti: New Zealand Biodiversity Recording Network ylläpitää portaalia iNaturalist NZ — Mātaki Taiao (inaturalist.nz).";

/* News project button */
"News" = "Uutiset";

/* Confirm a new photo */
"NEXT" = "SEURAAVA";

/* Generic negative response to a yes/no question
   negative response to binary choice, yes or no */
"No" = "Ei";

/* No comment provided by engineer. */
"No description" = "Ei kuvausta";

/* No comment provided by engineer. */
"No iNaturalist Results" = "Ei iNaturalist-tuloksia";

/* place guess when we have no location information */
"No location" = "Ei sijaintia";

/* No comment provided by engineer. */
"No matching taxa" = "Ei täsmääviä taksoneita";

/* Title for No Media button in media picker */
"No Media" = "No Media";

/* title of alert when user tries to record a sound observation without granting mic permissions */
"No Microphone Permissions" = "Ei mikrofonin käyttölupaa";

/* No comment provided by engineer. */
"No network connection." = "Ei verkkoyhteyttä.";

/* No comment provided by engineer. */
"No network connection. :(" = "Ei verkkoyhteyttä. :(";

/* Header observation count title when there are none. */
"No Observations" = "Ei havaintoja";

/* Error notice when exploring observations, when no obserations were found within a map area. */
"No observations found in map area." = "Kartan alueelta ei löytynyt havaintoja.";

/* Error notice when exploring observations when no observations were found. */
"No observations found." = "Havaintoja ei löytynyt.";

/* No comment provided by engineer. */
"No observations yet." = "Ei havaintoja vielä.";

/* accessibility label for no photo button */
"No Photo" = "Ei kuvaa";

/* No comment provided by engineer. */
"No Photos or Sounds and Missing Identification" = "Ei kuvia tai ääniä ja tunnistus puuttuu";

/* No comment provided by engineer. */
"No such organisms found. :(" = "Eliötä ei löydy. :(";

/* No comment provided by engineer. */
"No such person found. :(" = "Henkilöä ei löydy. :(";

/* No comment provided by engineer. */
"No such place found. :(" = "Mitään tällaista paikkaa ei löytynyt. :(";

/* No comment provided by engineer. */
"No such project found. :(" = "Mitään tällaista projektia ei löytynyt. :(";

/* No comment provided by engineer. */
"No Thanks" = "Ei kiitos";

/* No comment provided by engineer. */
"No updates yet. Stay tuned!" = "Ei päivityksiä vielä. Pysy kanavalla!";

/* No comment provided by engineer. */
"No URL configured" = "URL-osoitetta ei ole määritetty";

/* do not change network partner button */
"No, don’t change my affiliation" = "Ei, älä vaihda verkostoa johon tunnuksesi on liitetty";

/* Title for no photo button in the camera when making a new observation. Can support two very short lines of text. */
"NO\nPHOTO" = "EI\nKUVAA";

/* No comment provided by engineer. */
"None, all rights reserved" = "Ei mitään, kaikki oikeudet pidätetään";

/* No comment provided by engineer. */
"Not Allowed" = "Ei sallittu";

/* 403 unauthorized title */
"Not Authorized" = "Ei varmennettu";

/* Placeholder for observation notes when making a new observation. */
"Notes..." = "Muistiinpanot...";

/* Observation option for explore leaderboard sorting. Must be short. */
"Obs" = "Hav";

/* obscured geoprivacy */
"Obscured" = "Piilotettu";

/* accessibility label for obs (date, title, subtitle, media, new activity) */
"Observation %@ %@ %@ %@ %@" = "Observation %1$@ %2$@ %3$@ %4$@ %5$@";

/* Project validation error, with the specific error */
"Observation Field Validation error: %@" = "Havaintokentän validointivirhe: %@";

/* No comment provided by engineer. */
"Observations" = "Havainnot";

/* observation count on the explore leaderboard. */
"Observations: %ld" = "Havainnot: %ld";

/* observation count on explore leaderboard when the user has species but not observations in the leaderboard. */
"Observations: *" = "Havaintoa: *";

/* Title for New Observation Tab Bar Button */
"Observe" = "Havainnoi";

/* No comment provided by engineer. */
"Observers" = "Havainnoijat";

/* Off state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"Off" = "Pois";

/* No comment provided by engineer. */
"OK" = "OK";

/* On state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"On" = "Päällä";

/* Title error with oops text. */
"Oops" = "Hups";

/* open geoprivacy */
"Open" = "Avoin";

/* No comment provided by engineer. */
"Open link in Safari" = "Avaa linkki Safarissa";

/* button to open settings when user needs to adjust mic permissions
   open settings button title */
"Open Settings" = "Avaa asetukset";

/* panama partner */
"Panama: Ministerio de Ambiente operating iNaturalistPa (panama.inaturalist.org)." = "Panama: Ministerio de Ambiente ylläpitää portaalia iNaturalistPa (panama.inaturalist.org).";

/* Error for bad password when making account */
"Passwords must be at least six characters in length." = "Salasanassa täytyy olla vähintään kuusi merkkiä.";

/* Accessibility Label for Pause Button (when recording audio) */
"Pause" = "Tauko";

/* No comment provided by engineer. */
"Paused" = "Keskeytetty";

/* No comment provided by engineer. */
"Permission denied" = "Lupa evätty";

/* Title for About Personal Information notice during signup */
"Personal Information" = "Henkilökohtaiset tiedot";

/* Title for Photo Library button in media picker */
"Photo Library" = "Kuvakirjasto";

/* Title for photo library error when making new obs
   Title for photo library fetch error when making new obs
   Title for photo load error alert msg */
"Photo Load Error" = "Kuvan lataamisvirhe";

/* Title for photo save error alert msg */
"Photo Save Error" = "Kuvan tallennusvirhe";

/* Title for photos error alert msg */
"Photos Error" = "Kuvavirhe";

/* accessibility label for pick from library button */
"Pick from Library" = "Poimi kirjastosta";

/* No comment provided by engineer. */
"Placeholder" = "Paikkamerkki";

/* helpful note about observations and collection projects on the screen where you can add observations to projects. */
"Please note: Observations will be automatically included in a collection project if they meet its requirements." = "Huom: Havainnot lisätään automaattisesti koontiprojektiin, jos ne täyttävät sen vaatimukset.";

/* No comment provided by engineer. */
"Please pick a valid location." = "Ole hyvä ja valitse sovelias paikka.";

/* Error message for the user, when the geocoder is telling us to slow down. */
"Please try again in a few moments." = "Yritä uudelleen hetken kuluttua.";

/* failure message when the user should just try again. */
"Please try again later." = "Yritä myöhemmin uudelleen.";

/* alert msg to change camera permissions */
"Please update camera permissions to take photos with iNaturalist" = "Päivitä kameran käyttöoikeudet ottaaksesi kuvia iNaturalistin avulla";

/* No comment provided by engineer. */
"Please upload to determine data quality" = "Ole hyvä ja lataa havainnot määrittääksesi datan laadun";

/* portugal partner */
"Portugal: Associação Biodiversidade Para Todos operating Biodiversity4All (Biodiversity4All.org)." = "Portugali: Associação Biodiversidade Para Todos ylläpitää portaalia Biodiversity4All (Biodiversity4All.org).";

/* label for a news post author */
"Posted by" = "Lähettänyt";

/* label for prefer no tracking switch in settings */
"Prefer No Tracking" = "Älä tallenna virhelokeja, mikäli mahdollista";

/* title for consent screen */
"Privacy" = "Yksityisyys";

/* Emphasized part of the privacy base text. */
"Privacy Policy" = "Tietosuojakäytäntö";

/* private geoprivacy */
"Private" = "Yksityinen";

/* choose projects button title. */
"Projects" = "Projektit";

/* Title for projects tutorial screen */
"Projects are collections of observations with a common purpose" = "Projektit kokoavat havaintoja, joilla on jotakin yhteistä";

/* No comment provided by engineer. */
"Pull to Refresh" = "Vedä päivittääksesi";

/* Rank in an ordered list */
"Rank" = "Luokka";

/* action to re-download a species guide from the server */
"Re-download" = "Lataa uudelleen";

/* Accessibility Label for Record Button (when recording audio)
   Accessibility Label for Record/Pause Button */
"Record" = "Tallenna";

/* Title for Record sound button in media picker */
"Record Sound" = "Tallenna ääntä";

/* Accessibility label for sound recorder */
"Recording Level (from 0 to 1)" = "Recording Level (from 0 to 1)";

/* Title for sound recording screen */
"Recording Sound" = "Tallenna ääntä";

/* No comment provided by engineer. */
"Remove active search filters" = "Remove active search filters";

/* No comment provided by engineer. */
"Remove current map area filter" = "Remove current map area filter";

/* No comment provided by engineer. */
"Remove my profile photo" = "Poista profilikuvani";

/* No comment provided by engineer. */
"Removing..." = "Poistetaan...";

/* No comment provided by engineer. */
"RESEARCH" = "TUTKIMUS";

/* research data quality */
"Research Grade" = "Tutkimusaste";

/* No comment provided by engineer. */
"Restricted to current map area" = "Rajoitettu nykyisen kartan alueelle";

/* No comment provided by engineer. */
"Resuming" = "Jatketaan";

/* Retake a photo */
"RETAKE" = "Uusi kuva";

/* accessibility label for reverse/switch camera button */
"Reverse Camera" = "Käänteinen kamera";

/* Title for save new observation button */
"SAVE" = "TALLENNA";

/* No comment provided by engineer. */
"Save Anyway" = "Tallenna silti";

/* Done button for recording observation sounds */
"Save Recording" = "Tallenna äänitys";

/* No comment provided by engineer. */
"Saving..." = "Tallennetaan...";

/* No comment provided by engineer. */
"Search" = "Hae";

/* placeholder for guide search field */
"Search for guide named..." = "Etsi opasta nimellä...";

/* placeholder for project search field */
"Search for project named..." = "Etsi projektin nimellä...";

/* No comment provided by engineer. */
"Searching for organisms..." = "Haetaan eliöitä...";

/* No comment provided by engineer. */
"Searching for people..." = "Haetaan ihmisiä...";

/* No comment provided by engineer. */
"Searching for place..." = "Haetaan paikkoja...";

/* No comment provided by engineer. */
"Searching for project..." = "Haetaan projekteja...";

/* No comment provided by engineer. */
"Searching for recent observations in map area" = "Haetaan viimeaikaisia havaintoja kartan alueella";

/* No comment provided by engineer. */
"Searching for recent observations worldwide" = "Haetaan viimeaikaisia havaintoja maailmanlaajuisesti";

/* No comment provided by engineer. */
"seen at '%@'" = "nähty paikassa '%@'";

/* No comment provided by engineer. */
"seen by '%@'" = "nähnyt '%@'";

/* basis for a suggestion */
"Seen Nearby" = "Nähty lähistöllä";

/* default select title */
"Select" = "Valitse";

/* select taxon title */
"Select \"%@\"" = "Valitse \"%@\"";

/* title for date selector */
"Select Date" = "Valitse päivämäärä";

/* title for geoprivacy selector */
"Select Privacy" = "Valitse tietosuoja";

/* No comment provided by engineer. */
"Selected Observation" = "Valittu havainto";

/* accessibility label for choose profile photo button */
"Set Profile Photo" = "Aseta profiilikuva";

/* Notice while we're setting up an iNat account for them */
"Setting up iNaturalist account..." = "Luodaan iNaturalist-tiliä...";

/* accessibility label for settings button
   Title for the settings screen. */
"Settings" = "Asetukset";

/* No comment provided by engineer. */
"Share" = "Share";

/* Title for share new observation button */
"SHARE" = "JAA";

/* Prompt to sign in on the Me tab header. */
"Share your observations with the community." = "Jaa havaintosi yhteisön kanssa.";

/* label for iNaturalist store (tshirts/etc) action in settings. */
"Shop the iNat Store" = "Vieraile iNat-kaupassa";

/* label for show common names switch in settings */
"Show common names" = "Näytä yleiskieliset nimet";

/* No comment provided by engineer. */
"Show nearby suggestions only" = "Näytä vain lähistöllä olevat ehdotukset";

/* label for scientific names shown first switch in settings */
"Show scientific names first" = "Näytä tieteelliset nimet ensin";

/* No comment provided by engineer. */
"Sign in with Google" = "Sign in with Google";

/* No comment provided by engineer. */
"Sign out" = "Kirjaudu ulos";

/* Title for button that allows users to sign up for a new iNat account */
"Sign Up" = "Rekisteröidy";

/* emphasis text for the 'switch to signup mode' button. must be a substring of the base text */
"Sign up now!" = "Rekisteröidy nyt!";

/* No comment provided by engineer. */
"Signing Out" = "Kirjaudutaan ulos";

/* skip button title */
"Skip ›" = "Ohita ›";

/* Alert text for the data transfer consent checkbox during create account. */
"Some data privacy laws, like the European Union's General Data Protection Regulation (GDPR), require explicit consent to transfer personal information from their jurisdictions to other jurisdictions where the legal protection of this information is not considered adequate. As of 2020, the European Union no longer considers the United States to be a jurisdiction that provides adequate legal protection of personal information, specifically because of the possibility of the US government surveilling data entering the US. It is possible other jurisdictions may have the same opinion. Using iNaturalist requires the storage of personal information like your email address, all iNaturalist data is stored in the United States, and we cannot be sure what legal jurisdiction you are in when you are using iNaturalist, so in order to comply with privacy laws like the GDPR, you must acknowledge that you understand and accept this risk and consent to transferring your personal information to iNaturalist's servers in the US. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account." = "Tietyt tietojensuojelulait, kuten GDPR, vaatii erityisen luvan yksityisiä tietoja siirrettäessä, kun tietojen turvallisuus ei ole riittävä. Vuodesta 2020 EU ei ole pitänyt Yhdysvaltoja paikkana, jossa tietojen pito on turvallista, koska maan hallitus voi tarkkailla tietoja. Kaikki iNaturalistiin syötetty informaatio, kuten sähköpostiosoite, varastoidaan Yhdysvalloissa, joten sinun on hyväksyttävä mahdollinen riski tietojensiirrossa Yhdysvaltoihin. Katso yksityisyyskäytäntömme ja käyttöehdot, jos haluat lisätietoja tietojen keräämisestä. Luvan epääminen onnistuu tilin poistolla, koska tiliä ei voi olla ilman, että tilitietoja olisi Yhdysvalloissa.";

/* No comment provided by engineer. */
"Somewhere..." = "Jossakin...";

/* Label for the sort selector in the explore leaderboard header. */
"Sort" = "Järjestä";

/* credit for the wikipedia snippet that we include in inat taxon pages. first substitution is the article name, the second substitution is the license name. */
"Source: Wikipedia, %1$@, %2$@" = "Lähde: Wikipedia, %1$@, %2$@";

/* Species option for Explore leaderboard sorting. Must be short. */
"Species" = "Laji";

/* species count on the explore leaderboard. */
"Species: %ld" = "Laji: %ld";

/* observation count on explore leaderboard when the user has observations but not species in the leaderboard. */
"Species: *" = "Laji: *";

/* Title for button in the explore tab that leads to the stats leaderboard. */
"Stats" = "Tilastot";

/* accessibility label for stop uploading button */
"Stop Uploading" = "Pysäytä tallennus";

/* No comment provided by engineer. */
"Suggest ID" = "Ehdota tunnistetta";

/* label for suggest species switch in settings */
"Suggest species" = "Ehdota lajia";

/* No comment provided by engineer. */
"Suggestions based on observations and identifications provided by the iNaturalist community, including %@, %@, %@, and many others." = "Ehdotukset perustuen iNaturalist-yhteisön havaintoihin ja tunnistuksiin, mukaan lukien %1$@, %2$@, %3$@ ja monet muut.";

/* No comment provided by engineer. */
"Suggestions based on observations and identifications provided by the iNaturalist community." = "Ehdotukset perustuen iNaturalist-yhteisön havaintoihin ja tunnistuksiin.";

/* Title of me header when syncing. */
"Syncing..." = "Synkronoidaan...";

/* Category of iOS standard places for place search */
"System Places" = "Järjestelmän paikat";

/* Tags (kind of like categories) are applied to the species in a guide, and allow the guide editor to group and organize the species in a guide. */
"TAGS" = "TUNNISTEET";

/* taiwan partner */
"Taiwan: National Chiayi University and Taiwan Forestry Research Institute supporting iNaturalist Taiwan (taiwan.inaturalist.org)." = "Taiwanin kansallinen Chiayin yliopisto ja metsäntutkimuslaitos tukevat iNaturalist Taiwania (taiwan.inaturalist.org).";

/* No comment provided by engineer. */
"Take a photo" = "Ota kuva";

/* No comment provided by engineer. */
"Taxon %@ %@" = "Taxon %1$@ %2$@";

/* Title for description/comment when adding an ID */
"Tell Us Why" = "Kerro meille miksi";

/* Emphasized part of the terms of service base text. */
"Terms of Service" = "Käyttöehdot";

/* Status message after a user sends info to iNat support after the database crashes early on launch. */
"Thank you for contacting iNat support. We'll get back to you as soon as we can." = "Kiitos yhteydenotostasi, otamme sinuun yhteyttä mahdollisimman pian.";

/* error message when user fails to input prompted text correctly */
"The entered text doesn't match." = "Syötetty teksti ei täsmää.";

/* No comment provided by engineer. */
"There are no observations for this project yet. Check back soon!" = "Tässä projektissa ei ole vielä havaintoja. Tule katsomaan myöhemmin uudelleen!";

/* Error for no data transfer consent consent when making account. */
"There is no way to have an iNaturalist account without storing personal information in the United States." = "Ei ole mitään keinoa saada iNaturalistista tiliä tallentamatta henkilötietoja Yhdysvaltoihin.";

/* Error for no personal info consent when making account. */
"There is no way to have an iNaturalist account without storing personal information." = "Ei ole mitään keinoa käyttää iNaturalistista tiliä tallentamatta henkilötietoja.";

/* Message when app fails to launch, the alert will have recovery suggestions */
"There was an error launching iNaturalist" = "iNaturalistin käynnistämisessä tapahtui virhe";

/* Unresolvable and unknown error during observation upload. */
"There was an unexpected error." = "Odottamaton virhe.";

/* No comment provided by engineer. */
"This observation has been voted as Casual Grade by the iNaturalist community." = "iNaturalist-yhteisö on äänestänyt että tämä havainto on epämuodollinen.";

/* No comment provided by engineer. */
"This observation is Casual Grade because it has been voted captive or cultivated by the iNaturalist community." = "Tämä havainto on epämuodollinen, koska iNaturalistin yhteisö on äänestänyt että se on vangittu tai viljelty.";

/* No comment provided by engineer. */
"This observation needs a date to be considered for Research Grade." = "Noustakseen tutkimustasolle tässä havainnoissa pitää olla päivämäärä.";

/* No comment provided by engineer. */
"This observation needs a location to be considered for Research Grade." = "Noustakseen tutkimustasolle tämä havainto tarvitsee sijaintitiedon.";

/* No comment provided by engineer. */
"This observation needs a more specific consensus ID to be considered for Research Grade." = "Noustakseen tutkimustasolle tämä havainto tarvitsee tarkempia tunnistuksia iNaturalist-yhteisöltä.";

/* No comment provided by engineer. */
"This observation needs a photo to be considered for Research Grade." = "Noustakseen tutkimustasolle tässä havainnoissa pitää olla valokuva tai äänite.";

/* No comment provided by engineer. */
"This observation needs more IDs from the iNat community to be considered for Research Grade." = "Noustakseen tutkimustasolle tämä havainto tarvitsee lisää tunnistuksia iNaturalist-yhteisöltä.";

/* No comment provided by engineer. */
"This project has no description." = "Tällä projektilla ei ole kuvausta.";

/* No comment provided by engineer. */
"This project has no title." = "Tällä projektilla ei ole otsikkoa.";

/* No comment provided by engineer. */
"This will also remove your observations from this project." = "Tämä myös poistaa havaintosi tästä projektista.";

/* No comment provided by engineer. */
"This will destroy any changes/additions you've made from this app that haven't been synced with iNaturalist.org." = "Tämä poistaa kaikki tässä sovelluksessa tekemäsi muutokset/lisäykset, joita ei ole vielä synkronoitu iNaturalist.org:iin.";

/* No comment provided by engineer. */
"This will download %@ of data so you can use this guide even when you don't have Internet access." = "Tämä lataa %@ tietoja, joten voit käyttää tätä opasta myös jos sinulla ei ole internet-yhteyttä.";

/* Label for the time period selector in the explore leaderboard header. */
"Time Period" = "Ajanjakso";

/* No comment provided by engineer. */
"Timeout" = "Aikakatkaisu";

/* project title header */
"Title" = "Otsikko";

/* Traditional inat type of project, where users have to manually add observations to the project. */
"Traditional Project" = "Perinteinen projekti";

/* No comment provided by engineer. */
"Try again next time you're connected to the Internet." = "Kokeile uudelleen seuraavan kerran kun olet yhteydessä internetiin.";

/* button title to turn on autoupload */
"Turn On" = "Kytke päälle";

/* message of autoupload introduction alert view */
"Turn on Auto Upload and your observations will be automatically uploaded to iNaturalist." = "Ota käyttöön automaattinen lataus niin havaintosi tallennetaan automaattisesti iNaturalistiin.";

/* Umbrella type of project, which contains other projects within it. */
"Umbrella Project" = "Umbrella-projekti";

/* Failure message when making an identification */
"Unable to add an identification to this observation. Please try again later." = "Tunnistusta ei voitu lisätä tähän havaintoon. Ole hyvä ja yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"Unable to find location" = "Sijaintiasi ei voida löytää";

/* place guess when we have lat/lng but it's not geocoded */
"Unable to find location name" = "Paikan nimeä ei löydy";

/* Failure message when making an identification */
"Unable to identify this observation to that species. Please try again later." = "Tätä havaintoa ei voitu tunnistaa tuoksi lajiksi. Ole hyvä ja yritä myöhemmin uudelleen.";

/* This is an explanation for when we get a 401 during upload/sync. */
"Unable to upload to iNaturalist, error 401 unauthenticated. Please contact help@inaturalist.org and try later." = "Havaintoja ei voitu ladata iNaturalistiin (virhe 401 unauthenticated). Ole hyvä ja ota yhteyttä osoitteeseen help@inaturalist.org ja yritä myöhemmin uudelleen.";

/* uk partner */
"United Kingdom: National Biodiversity Network Trust supporting iNaturalist United Kingdom (uk.inaturalist.org)." = "Yhdistyneiden kuningaskuntien kansallinen biodiversiteettiverkosto tukee iNaturalist United Kingdomia (uk.inaturalist.org).";

/* unknown taxon */
"Unknown" = "Tuntematon";

/* Text shown in place of a post author when a post has no known author */
"Unknown author" = "Tuntematon tekijä";

/* Message body when we don't know the error */
"Unknown error" = "Tuntematon virhe";

/* Unknown error */
"Unknown error while making an identification." = "Tuntematon virhe tunnistusta tehtäessä.";

/* message to the user when we get an unknown error. the %ld will be a status code */
"Unknown Error: %ld" = "Tuntematon virhe: %ld";

/* Title displayed for a journal post when the post has no title */
"Untitled Post" = "Nimetön viesti";

/* Title for progress view when migrating db */
"Updating database..." = "Päivitetään tietokantaa...";

/* No comment provided by engineer. */
"Updating..." = "Päivitetään...";

/* accessibility labelf for upload button
   Title for upload button. */
"Upload" = "Lähetä";

/* No comment provided by engineer. */
"Upload Error" = "Lähetysvirhe";

/* upload failed alert title */
"Upload Failed" = "Lähetys epäonnistui";

/* No comment provided by engineer. */
"Upload this observation" = "Upload this observation";

/* No comment provided by engineer. */
"Upload this observation to enable comments & identifications." = "Lähetä tämä havainto ottaaksesi kommentit ja tunnistamiset käyttöön.";

/* No comment provided by engineer. */
"Upload this observation to enable faves." = "Lähetä tämä havainto, jotta siitä voisi tehdä suosikin.";

/* subtitle for observation while it's uploading. */
"Uploading..." = "Lähetetään...";

/* label for username field in settings
   The desired username during signup. */
"Username" = "Käyttäjänimi";

/* users can login with their username or their email address. */
"Username or email" = "Käyttäjätunnus tai sähköposti";

/* Title for version section of settings. */
"Version" = "Versio";

/* label for start video tutorial action in settings. */
"Video Tutorial" = "Video-opastus";

/* button to view privacy policy */
"View Privacy Policy" = "Katso tietosuojakäytäntö";

/* unknown taxon subtitle when suggestions are available */
"View suggestions" = "Paina tästä niin näet ehdotuksia";

/* button to view terms of use */
"View Terms of Use" = "Katso käyttöehdot";

/* Subtitle below image for projects tutorial screen. The string is the URL for iNat (or partner site) */
"Visit %@ to create your own projects" = "Vieraile osoitteessa %@ luodaksesi omia projektejasi";

/* Subtitle below image for guides tutorial screen */
"Visit iNaturalist.org to create your own guides" = "Vieraile iNaturalist.orgissa luodaksesi omia oppaitasi";

/* basis for a species suggestion */
"Visually Similar" = "Visuaalisesti samanlainen";

/* basis for a species suggestion */
"Visually Similar / Seen Nearby" = "Visuaalisesti samanlainen / nähty lähistöllä";

/* Subtitle for observation when waiting to upload. */
"Waiting to upload..." = "Odotetaan lähettämistä...";

/* inat ios translators with more than 200 strings contributed, alphabetically */
"We are grateful for the translation assistance provided by the crowdin.com community, especially: Catherine B, Vladimir Belash, cgalindo, danieleseglie, Eduardo Martínez, naofum, Foss, jacquesboivin, Sungmin Ji, katunchik, NCAA, oarazy, sudachi, T.O, testamorta, and vilseskog. To join the iNaturalist iOS translation team, please visit https://crowdin.com/project/inaturalistios." = "Olemme kiitollisia käännösavusta Crowdin.com-yhteisölle. Ryhtyäksesi kääntäjäksi mene osoitteeseen https://crowdin.com/project/inaturalistios";

/* No comment provided by engineer. */
"We don't have permission from iOS to use your location." = "Meillä ei ole iOS: lta lupaa käyttää sijaintiasi.";

/* Alert text for the personal information checkbox during create account. */
"We store personal information like usernames and email addresses in order to manage accounts on this site, and to comply with privacy laws, we need you to check this box to indicate that you consent to this use of personal information. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account." = "Varastoimme tietoja, kuten käyttäjänimiä ja salasanoja, jotta voimme hallita tilejä sivustollamme. Valitse laatikko antaaksesi luvan tietojen varastointiin. Lisätietoja tietosuojakäytännöissä ja käyttöehdoissa. Et voi omistaa iNaturalist-tiliä ilman, että sen tietoja varastoidaan. Voit perua luvan vain poistamalla tilisi.";

/* base error message when icloud photo fetch fails */
"We're not able to fetch your photo from iCloud: %@" = "Kuvan nouto iCloudista epäonnistui: %@";

/* No comment provided by engineer. */
"We're not confident enough to make a recommendation, but here are our top suggestions." = "Emme ole riittävän varmoja antaaksemme suositusta, mutta tässä on kymmenen parasta ehdotusta.";

/* No comment provided by engineer. */
"We're not confident enough to make a recommendation." = "Emme ole tarpeeksi varmoja tekemään suositusta.";

/* comment for common ancestor suggestion. %1$@ is the rank name (order, family), whereas %2$@ is the actual rank (Animalia, Insecta) */
"We're pretty sure this is in the %1$@ %2$@." = "Olemme melko varmoja että tämä on %1$@ %2$@.";

/* unknown taxon title */
"What did you see?" = "Mitä näet?";

/* title for alert explaining what captive means */
"What does captive / cultivated mean?" = "Mitä vangittu / viljelty tarkoittaa?";

/* No comment provided by engineer. */
"Which organism?" = "Mikä organismi?";

/* No comment provided by engineer. */
"Which person?" = "Mikä henkilö?";

/* No comment provided by engineer. */
"Which place?" = "Mikä paikka?";

/* No comment provided by engineer. */
"Which project?" = "Mikä projekti?";

/* No comment provided by engineer. */
"Whoops" = "Hupsis";

/* Default upload failure alert title. */
"Whoops!" = "Hupsis!";

/* No comment provided by engineer. */
"Without a date, this observation may be very hard for others to identify accurately, and will never attain research grade." = "Jos havainnolla ei ole päivämäärää, muiden on vaikea tunnistaa sitä eikä se voi saavuttaa tutkimustasoa.";

/* No comment provided by engineer. */
"Without a location, this observation will be very hard for others to identify and will never attain research grade." = "Jos havainnolla ei ole paikkaa, muiden on vaikea tunnistaa sitä eikä se voi saavuttaa tutkimustasoa.";

/* No comment provided by engineer. */
"Without at least one photo or sound, this observation will be impossible for others to help identify." = "Muut eivät voi auttaa määrittämään havaintoa, mikäli sillä ei ole yhtään kuvaa tai äänitettä.";

/* message for alert when db migration has a problem */
"Would you like to share your migration report with help@inaturalist.org for debugging?" = "Haluaisitko jakaa siirtoraportin osoitteeseen help@inaturalist.org vianetsintää varten?";

/* positive response to binary choice, yes or no */
"Yes" = "Kyllä";

/* change network partner button */
"Yes, change my affiliation" = "Kyllä, vaihda";

/* No comment provided by engineer. */
"Yes, delete this observation" = "Kyllä, poista tämä havainto";

/* cc licensing consent checkbox label */
"Yes, license my content so scientists can use my data." = "Kyllä, lisensoi sisältöni, jotta tutkijat voivat käyttää keräämiäni tietoja.";

/* failure message when the user tries to change their network affiliation too often */
"You can only change your network affiliation once per day." = "Voit vaihtaa tunnuksesi liitoksen vain kerran päivässä.";

/* 403 forbidden message */
"You don't have permission to do that. Your account may have been suspended. Please contact help@inaturalist.org" = "Sinulla ei ole oikeuksia tehdä tätä. Tilisi voi olla jäädytetty. Ole hyvä ja ota yhteyttä osoitteeseen help@inaturalist.org";

/* 403 forbidden message */
"You don't have permission to do that. Your account may have been suspended. Please contact help@inaturalist.org." = "Sinulla ei ole oikeuksia tehdä tätä. Tilisi voi olla jäädytetty. Ole hyvä ja ota yhteyttä osoitteeseen help@inaturalist.org.";

/* No comment provided by engineer. */
"You must be connected to the Internet to do this." = "Sinun on oltava yhteydessä internetiin tehdäksesi tämän.";

/* No comment provided by engineer. */
"You must be connected to the Internet to upload to iNaturalist.org" = "Sinun on oltava yhteydessä internetiin ladataksesi havaintoja iNaturalistiin";

/* No comment provided by engineer. */
"You must be logged in to access projects." = "Sinun täytyy olla kirjautunut sisään päästäksesi projekteihin.";

/* Unspecific signup prompt reason. */
"You must be logged in to do that." = "Sinun täytyy olla kirjautunut sisään tehdäksesi tämän.";

/* Signup prompt reason when user tries to sync user projects. */
"You must be logged in to sync user projects." = "Sinun täytyy olla kirjautunut sisään sykronoidaksesi projektit.";

/* This is an explanation for why the upload button triggers a login prompt. */
"You must be logged in to upload." = "Sinun pitää kirjautua sisään lisätäksesi havaintoja.";

/* No comment provided by engineer. */
"You must be logged in!" = "Sinun täytyy olla kirjautunut sisään!";

/* Account is required error message */
"You must be logged in." = "Sinun täytyy olla kirjautunut sisään.";

/* Reason text for signup prompt while trying to join a project. */
"You must be signed in to join a project." = "Sinun täytyy olla kirjautunut sisään liittyäksesi projektiin.";

/* Reauthentication to delete account tip. */
"You must re-authenticate to delete your account." = "Sinun täytyy tunnistautua uudelleen poistaaksesi tilisi.";

/* 401 unauthorized message when signed out */
"You need to log in to do that." = "Sinun täytyy kirjautua ensin.";

/* No comment provided by engineer. */
"You will receive updates once you've uploaded observations." = "Saat päivityksiä, kun olet lähettänyt havaintoja.";

/* Title for account section of settings. */
"Your Account" = "Tilisi";

/* account deletion confirmation msg */
"Your account has been deleted." = "Your account has been deleted.";

/* No comment provided by engineer. */
"Your Guides" = "Oppaasi";

/* 401 unauthorized message when signed in */
"Your login credentials appear to have changed. Please go to Settings to sign out and then sign in again." = "Your login credentials appear to have changed. Please go to Settings to sign out and then sign in again.";

/* Placeholder for free text observation field value */
"Your response here" = "Vastauksesi tähän";
